---
kind: enumMember
id: F:Autodesk.Revit.DB.StructuralAssetClass.Undefined
enum: Autodesk.Revit.DB.StructuralAssetClass
source: html/f62eea04-3d37-6450-9d5b-52627d3e677b.htm
---
# Autodesk.Revit.DB.StructuralAssetClass.Undefined

Structural asset class is undefined.